app/Controllers/Admin/Cotizaciones.php

	public function index()
	{
		$db = \Config\Database::connect();

		$builder = $db->table('sellopro_cotizaciones');
		$builder->join('sellopro_clientes','sellopro_clientes.idCliente = sellopro_cotizaciones.cliente');
		$resultado = $builder->get()->getResultArray();
---
SELECT *
FROM `sellopro_cotizaciones`
SELECT *
FROM `sellopro_clientes`

	public function pagina($slug)
	{
		//vamos a buscar la cotizacion

		$cliente = new CotizacionesModel();
		$cliente->where('slug',$slug);
		$resultado = $cliente->findAll();

		$id = $resultado[0]['slug'];
		$cotizacion = $resultado[0]['idQt'];

		//buscamos los ariticulos
		$articulos = new ArticulosModel();

		$db = \Config\Database::connect();
		$builder = $db->table('sellopro_cotizaciones');
		$builder->where('slug',$id);
		$builder->join('sellopro_clientes','sellopro_clientes.idCliente = sellopro_cotizaciones.cliente');
		$query['cliente'] = $builder->get()->getResultArray();
---
SELECT *
FROM `sellopro_cotizaciones`
JOIN `sellopro_clientes` ON `sellopro_clientes`.`idCliente` = `sellopro_cotizaciones`.`cliente`
WHERE `slug` = 'DS6o8bOKhLWq'